&НаКлиенте
Процедура Считать(Команда)
	КоличествоПосетителей = КоличествоПосетителей + 1;
КонецПроцедуры

&НаСервере
Процедура СохранитьПодсчетНаСервере()
	НовыйПодсчет = Справочники.Подсчеты.СоздатьЭлемент();
	НовыйПодсчет.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	НовыйПодсчет.КоличествоПосетителей = КоличествоПосетителей;
	НовыйПодсчет.Наименование = ПараметрыСеанса.ТекущийПользователь;
	НовыйПодсчет.Записать();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПодсчет(Команда)
	СохранитьПодсчетНаСервере();
	Предупреждение("Подсчет сохранен");
	Закрыть();
КонецПроцедуры
