&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Приветствие = "Привет";
КонецПроцедуры

&НаКлиенте
Процедура УказатьРевизора(Команда)
	Имя = "";
	ЗаголовокВопроса = "Введите имя";
	Если ВвестиСтроку(Имя, ЗаголовокВопроса, 0, Истина) Тогда
		ЗапомнитьИмя(Имя);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьИмя(Имя)
	ПараметрыСеанса.ТекущийПользователь = Имя;
	Приветствие = "Привет, " + Имя;
КонецПроцедуры	

&НаКлиенте
Процедура СчитатьПосетителей(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаПодсчетаПосетителей");
КонецПроцедуры
