
Функция SendCountSendCount(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	//Создаем новую переменную для расшифровки
	//полученных данных из мобильного приложения
	ЧтениеJSON = Новый ЧтениеJSON();
	
	//Устанавливаем текст, который хотим расшифровать
	//Мы его отправляем в параметре "SendCount"
	ЧтениеJSON.УстановитьСтроку(Запрос.ПараметрыЗапроса.Получить("SendCount"));
	
	//Записываем в переменную "Подсчет" расшифрованные данные
	Подсчет = ПрочитатьJSON(ЧтениеJSON);
	
	//Закрываем чтение, так как оно нам больше не нужно
	ЧтениеJSON.Закрыть();
	
	//Начинаем записывать достижения в справочник
	
	//Создаем новый элемент в справочнике
	НовыйПодсчет = Справочники.Подсчеты.СоздатьЭлемент();
	
	//Заполняем поля наименование, контролер и количество брака
	НовыйПодсчет.Наименование = Подсчет.Наименование;
	НовыйПодсчет.КонтролерКачества = Подсчет.КонтролерКачества;
	НовыйПодсчет.КоличествоБракованнойПродукции = Подсчет.КоличествоБракованнойПродукции;
	
	//Записываем подсчет
	НовыйПодсчет.Записать();
	
	//Возвращаем строку "Данные записаны" HTTP-сервису
	Ответ.УстановитьТелоИзСтроки("Данные записаны", КодировкаТекста.ANSI);
	
	Возврат Ответ;

КонецФункции
